test_cases/2d_r134a/Wedge_Throttle_laminar/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  
p
{
    solver          PBiCGStab;  // for large problems, use GAMG
//    smoother        symGaussSeidel;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
}


U
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
}


h
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}


rho
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
}


x
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
}


y
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
}


epsilon
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
}


k
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
}

	
}

PISO
{

    nCorrectors     15;
    NRepsilon	    1.0e-04;
    nNonOrthogonalCorrectors  0;
	
}

 relaxationFactors
{
      p               0.3;
      U               0.3;
      pFlux           0.3;
//      k   0.15;
//      epsilon  0.15;
}



// ************************************************************************* //
